In [24]:
import pandas as pd
import numpy as np

In [2]:
csv_1 = pd.read_csv("Test.csv")

In [3]:
csv_1

   Unnamed: 0  a  b
0           0  1  5
1           1  2  6
2           2  3  7
3           3  4  8

In [4]:
csv_1.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
csv_1.columns

Index(['Unnamed: 0', 'a', 'b'], dtype='object')

In [6]:
csv_1.describe()

       Unnamed: 0         a         b
count    4.000000  4.000000  4.000000
mean     1.500000  2.500000  6.500000
std      1.290994  1.290994  1.290994
min      0.000000  1.000000  5.000000
25%      0.750000  1.750000  5.750000
50%      1.500000  2.500000  6.500000
75%      2.250000  3.250000  7.250000
max      3.000000  4.000000  8.000000

In [7]:
csv_1.head(2)

   Unnamed: 0  a  b
0           0  1  5
1           1  2  6

In [8]:
csv_1.tail(2)

   Unnamed: 0  a  b
2           2  3  7
3           3  4  8

In [20]:
csv_1[1:2]

   Unnamed: 0  a  b
1           1  2  6

In [21]:
print(type(csv_1))

<class 'pandas.core.frame.DataFrame'>

In [23]:
# csv_1.index.array

<PandasArray>
[0, 1, 2, 3]
Length: 4, dtype: int64

In [30]:
# csv_1.to_numpy()
# v = np.asarray(csv_1)
# v

array([[0, 1, 5],
       [1, 2, 6],
       [2, 3, 7],
       [3, 4, 8]], dtype=int64)

In [32]:
csv_1

   Unnamed: 0  a  b
0           0  1  5
1           1  2  6
2           2  3  7
3           3  4  8

In [35]:
csv_1.sort_index(axis =0 , ascending = False)

   Unnamed: 0  a  b
3           3  4  8
2           2  3  7
1           1  2  6
0           0  1  5

In [37]:
# csv_1["a"]= "python"
# csv_1

   Unnamed: 0       a  b
0           0  python  5
1           1  python  6
2           2  python  7
3           3  python  8

In [42]:
csv_1.loc[0,"unnamed"]= "python2"

In [43]:
csv_1

   Unnamed: 0       a  b  unnamed
0           0  python  5  python2
1           1  python  6      NaN
2           2  python  7      NaN
3           3  python  8      NaN

In [47]:
var2 = csv_1.loc[[1,3],['a','unnamed']]

In [48]:
var2

        a unnamed
1  python     NaN
3  python     NaN

In [53]:
var3 = csv_1.loc[:,["a","b"]]

In [54]:
var3

        a  b
0  python  5
1  python  6
2  python  7
3  python  8

In [57]:
var4 = csv_1.iloc[1,2]

In [59]:
var4

6

In [60]:
var5 = csv_1.drop('a',axis=1)

In [61]:
var5

   Unnamed: 0  b  unnamed
0           0  5  python2
1           1  6      NaN
2           2  7      NaN
3           3  8      NaN

In [64]:
csv_1

   Unnamed: 0       a  b  unnamed
0           0  python  5  python2
1           1  python  6      NaN
2           2  python  7      NaN
3           3  python  8      NaN

In [69]:
var6 = csv_1.drop(1,axis=0)

In [70]:
var6

   Unnamed: 0       a  b  unnamed
0           0  python  5  python2
2           2  python  7      NaN
3           3  python  8      NaN